<a href="https://colab.research.google.com/github/ragalaa/Directory/blob/master/Pandas_Dataframe_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
!git clone https://github.com/magdapoppins/pandas-basics.git

fatal: destination path 'pandas-basics' already exists and is not an empty directory.

In [12]:
import json
import pandas as pd
import numpy as np

records = [
    ('Math', 'Chemistry', 'Physics'),
    ('Crafts','Art', 'Electronics')]

pd.DataFrame.from_records(records)

        0          1            2
0    Math  Chemistry      Physics
1  Crafts        Art  Electronics

In [26]:
# dataset = pd.read_csv('\pandas-basics\artworkdata.csv')
numpArray = np.random.rand(3)
type(numpArray)

my_series = pd.Series(numpArray,index=["First","second","third"])  ## Labels defined our self.
## Index using Label
# my_series["First"]
my_series.index

Index(['First', 'second', 'third'], dtype='object')

In [28]:
### More columns than one

array_2d = np.random.rand(3,2)
array_2d

array([[0.23073318, 0.61880705],
       [0.00273927, 0.37562751],
       [0.73933144, 0.72875963]])

In [29]:
array_2d[0,1]

0.6188070518728948

In [31]:
## Creating data frame

df = pd.DataFrame(array_2d)
df

          0         1
0  0.230733  0.618807
1  0.002739  0.375628
2  0.739331  0.728760

In [32]:
df.columns =["First","second"]
df

      First    second
0  0.230733  0.618807
1  0.002739  0.375628
2  0.739331  0.728760

In [33]:
df["second"]

0    0.618807
1    0.375628
2    0.728760
Name: second, dtype: float64

# Pandas Data Input capabilities:

In [41]:

COLS_TO_USE = ['id','artist','title','medium','year','acquisitionYear','height','width','units']
Dataset = pd.read_csv('./pandas-basics/artworkdata.csv',nrows = 5 , 
                      index_col='id', usecols=['id','artist'],low_memory=False)
Dataset.head()

              artist
id
1035   Blake, Robert
1036   Blake, Robert
1037   Blake, Robert
1038   Blake, Robert
1039  Blake, William

In [43]:
Dataset = pd.read_csv('./pandas-basics/artworkdata.csv',nrows = 50 , 
                      index_col='id', usecols=COLS_TO_USE,low_memory=False)
Dataset.head()

              artist  ... units
id                    ...
1035   Blake, Robert  ...    mm
1036   Blake, Robert  ...    mm
1037   Blake, Robert  ...    mm
1038   Blake, Robert  ...    mm
1039  Blake, William  ...    mm

[5 rows x 8 columns]

In [0]:
## Load to disk by serializing the data the python Objects
df.to_pickle("./pandas-basics/dummy.pkl")

In [45]:
### JSON nested Objects
## Traverse folders to get all json files
## Find the way to read them so that pandas understands
### Try to produceidentical DataFrame as  for CSV

records = [("Espresso","5$"),
           ("Flat White", "10$")]
pd.DataFrame.from_records(records)
pd.DataFrame.from_records(records, columns=["coffe","price"])

        coffe price
0    Espresso    5$
1  Flat White   10$